; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   red_block_1 orange_block_1 red_block_2 black_block_1 white_block_1 grey_block_1 yellow_block_1 - block
 )
 (:init (ontable red_block_1) (ontable orange_block_1) (ontable red_block_2) (on black_block_1 orange_block_1) (on white_block_1 red_block_1) (on grey_block_1 black_block_1) (on yellow_block_1 grey_block_1) (clear red_block_2) (clear white_block_1) (clear yellow_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (holding red_block_2)))
 (:constraints (sometime (holding black_block_1)) (sometime (not (clear red_block_2))) (sometime-before (not (clear red_block_2)) (and (holding white_block_1) (ontable black_block_1))) (sometime (and (on yellow_block_1 red_block_1) (clear orange_block_1))) (sometime (clear grey_block_1)) (sometime (and (not (ontable orange_block_1)) (clear orange_block_1))))
 (:metric minimize (total-cost))
)

; plan
1. (unstack white_block_1 red_block_1)
   deleted: (on white_block_1 red_block_1) (clear white_block_1) (handempty)
   added: (holding white_block_1) (clear red_block_1)
   goals met: 0 of 1
2. (putdown white_block_1)
   deleted: (holding white_block_1)
   added: (clear white_block_1) (handempty) (ontable white_block_1)
   goals met: 0 of 1
3. (unstack yellow_block_1 grey_block_1)
   deleted: (on yellow_block_1 grey_block_1) (clear yellow_block_1) (handempty)
   added: (holding yellow_block_1) (clear grey_block_1)
   goals met: 0 of 1
4. (stack yellow_block_1 red_block_1)
   deleted: (clear red_block_1) (holding yellow_block_1)
   added: (handempty) (clear yellow_block_1) (on yellow_block_1 red_block_1)
   goals met: 0 of 1
5. (unstack grey_block_1 black_block_1)
   deleted: (on grey_block_1 black_block_1) (clear grey_block_1) (handempty)
   added: (holding grey_block_1) (clear black_block_1)
   goals met: 0 of 1
6. (putdown grey_block_1)
   deleted: (holding grey_block_1)
   added: (clear grey_block_1) (handempty) (ontable grey_block_1)
   goals met: 0 of 1
7. (unstack black_block_1 orange_block_1)
   deleted: (on black_block_1 orange_block_1) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear orange_block_1)
   goals met: 0 of 1
8. (putdown black_block_1)
   deleted: (holding black_block_1)
   added: (clear black_block_1) (handempty) (ontable black_block_1)
   goals met: 0 of 1
9. (pickup white_block_1)
   deleted: (clear white_block_1) (ontable white_block_1) (handempty)
   added: (holding white_block_1)
   goals met: 0 of 1
10. (stack white_block_1 red_block_2)
   deleted: (clear red_block_2) (holding white_block_1)
   added: (handempty) (clear white_block_1) (on white_block_1 red_block_2)
   goals met: 0 of 1
11. (pickup orange_block_1)
   deleted: (clear orange_block_1) (ontable orange_block_1) (handempty)
   added: (holding orange_block_1)
   goals met: 0 of 1
12. (stack orange_block_1 black_block_1)
   deleted: (clear black_block_1) (holding orange_block_1)
   added: (handempty) (clear orange_block_1) (on orange_block_1 black_block_1)
   goals met: 0 of 1
13. (unstack white_block_1 red_block_2)
   deleted: (on white_block_1 red_block_2) (clear white_block_1) (handempty)
   added: (holding white_block_1) (clear red_block_2)
   goals met: 0 of 1
14. (putdown white_block_1)
   deleted: (holding white_block_1)
   added: (clear white_block_1) (handempty) (ontable white_block_1)
   goals met: 0 of 1
15. (pickup red_block_2)
   deleted: (clear red_block_2) (ontable red_block_2) (handempty)
   added: (holding red_block_2)
   goals met: 1 of 1
